package com.example.devicelibrary

class ItemData() {
    var cnName = ""
    var ehName = ""
    var content = ""
}


object ListName {
    val hardwareList = arrayOf(
        "是否是平板(1:是；0：不是)", "系统版本", "cpu最大频率", "builder类型",
        "设备分辨率", "设备指纹", "基带版本", "获取设备指令集名称", "系统引导加载程序版本号", "cpu名字",
        "执行代码编译的Host值", "设备型号", "无线电固件版本", "修订版本列表", "物理尺寸", "获取第二个指令集名称",
        "设备品牌", "硬件名", "产品名称", "手机cpu架构，支持的指令集", "显示屏参数", "设备序列号", "制造商",
        "cpu当前频率", "描述Build的标签", "SDK版本号", "屏幕密度（像素比例：0.75/1.0/1.5/2.0）",
        "编译时间",
        "设备参数",
        "执行代码编译的User值",
        "build基本操作系统",
        "主板名称", "cpu最小频率", "屏幕密度（每寸像素：120/160/240/320）"
    )

}